starter_viscosity_change/channel_custom_code_mod_validation/Allrun
#!/usr/bin/env bash
# Code-mod validation template: case-local library + simpleFoam (mesh must exist).
set -euo pipefail
ROOT="$(cd "$(dirname "${BASH_SOURCE[0]}")" && pwd)"
cd "$ROOT"

if ! command -v simpleFoam >/dev/null 2>&1; then
  echo "ERROR: OpenFOAM not in PATH. Run: source \"\$WM_PROJECT_DIR/etc/bashrc\"" >&2
  exit 1
fi

MD="$ROOT/customModels/CustomNuImplementACustom"
if [[ ! -f "$MD/platforms/linux64GccDPInt32Opt/lib/libCustomNuImplementACustom.so" ]]; then
  echo "Building case-local viscosity library..."
  ( cd "$MD" && wmake libso )
fi

if [[ ! -f constant/polyMesh/faces ]]; then
  blockMesh
fi

simpleFoam
