starter_viscosity_change/channel_custom_code_mod_validation/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}

simulationType laminar;
laminar
{
    model               generalisedNewtonian;
    viscosityModel      CustomNuImplementACustom;
    printCoeffs         on;

    CustomNuImplementACustomCoeffs
    {
        nu_inf      1e-06;
        k           1e-03;
        n           0.6;
        gammaDotmin 1e-06;
    }
}
