starter_viscosity_change/channel_custom_code_mod_validation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          20;
        startFace       7780;
        matchTolerance  0.0001;
        neighbourPatch  outlet;
        transformType   translational;
        separation      (-2 0 0);
    }
    outlet
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          20;
        startFace       7800;
        matchTolerance  0.0001;
        neighbourPatch  inlet;
        transformType   translational;
        separation      (2 0 0);
    }
    topWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       7820;
    }
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       8020;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          8000;
        startFace       8220;
    }
)

// ************************************************************************* //
